app/controllers/user_authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = $1 LIMIT $2  [["user_id", "test@test.test"], ["LIMIT", 1]]
---
  def login
    user = User.new
    user.user_id = params[:user_id]
    user.password = params[:password]
    @user_id = user.user_id
    @password = user.password

    if !(user.valid?) then
      @messages = user.errors.full_messages
      render 'index'
      return
    end
    # userテーブルを検索
    user = User.find_by(:user_id => params[:user_id])